christopher_nekich/week_05/day_03/cage/app/views/movies/_form.html.erb

SELECT "actors"."name", "actors"."id" FROM "actors"
---
  	<%= f.label :actor_id %>
  	<%= f.select :actor_id, Actor.pluck(:name, :id), :include_blank => true %>