christopher_nekich/week_05/day_03/cage/app/views/actors/show.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."actor_id" = ?  [["actor_id", 1]]
---
<div class="scrollbox">
  <% @actor.movies.each do |m| %>