madeleine_milasas/week_05/day_03/glastonbury/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "country", "year", "members", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    band = Band.create band_params

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @band = Band.find params[:id]