christopher_nekich/week_05/day_02/lastwords/app/controllers/words_controller.rb

def create
  word = Word.new
  word.name = params[:name]
  word.quote = params[:quote]
  word.description = params[:description]
  word.died_from = params[:died_from]
  word.died = params[:died]
  word.death_age = params[:death_age]
  word.image = params[:image]

  word.save
---
INSERT INTO "words" ("name", "quote", "description", "died_from", "died", "image") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Blah"], ["quote", ""], ["description", ""], ["died_from", ""], ["died", ""], ["image", ""]]

def destroy
  word = Word.find params[:id]
  word.destroy
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 6]]

def edit
  @word = Word.find params[:id]
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def update
  word = Word.find params[:id]
  word.update :name => params[:name], :quote => params[:quote], :description => params[:description], :died_from => params[:died_from], :died => params[:died], :death_age => params[:death_age], :image => params[:image]
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "words" SET "description" = ? WHERE "words"."id" = ?  [["description", "John Marshall Alexander Jr. known by the stage name Johnny Ace, was an American rhythm-and-blues singer. He had a string of hit singles in the mid-1950s."], ["id", 4]]