sheren_to/week_05/day_02/hydrosphere/app/controllers/oceans_controller.rb

INSERT INTO "oceans" ("name", "image", "area", "depth") VALUES (?, ?, ?, ?)  [["name", "Arctic2"], ["image", "http://www.cbc.ca/kidscbc2/content/the_feed/wts_arctic_antarctic.jpg"], ["area", 1.0], ["depth", 2.0]]
---
  def create
    ocean = Ocean.new
    ocean.name = params[:name]
    ocean.image = params[:image]
    ocean.area = params[:area]
    ocean.depth = params[:depth]
    ocean.save