christopher_nekich/week_05/day_03/cage/app/controllers/actors_controller.rb

  def show
    @actor = Actor.find params[:id]
---
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]