christopher_nekich/week_05/day_03/cage/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "rating", "country", "release", "cover", "created_at", "updated_at", "actor_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "cover" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["cover", "https://www.movieposter.com/posters/archive/main/67/MPW-33589"], ["updated_at", "2017-11-22 20:06:24.157656"], ["id", 5]]